Котельников_АБ_70153995/src/Documents/ПроведениеТелефонногоИнтервью/ПроведениеТелефонногоИнтервью.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеТелефонногоИнтервью</name>
  <basedOn>Document.РегистрацияКандидатов</basedOn>
  <registerRecords>InformationRegister.СтатусыКандидатов</registerRecords>
  <registerRecords>AccumulationRegister.КоличествоКандидатовПоЭтапам</registerRecords>
  <attributes>
    <name>СтатусИнтервью</name>
    <type>
      <types>EnumRef.СтатусыТелефонногоИнтервью</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>EnumRef.РезультатыТелефонногоИнтервью</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРезультата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКандидата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭмаилКандидата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

Котельников_АБ_70153995/src/AccumulationRegisters/КоличествоКандидатовПоЭтапам/КоличествоКандидатовПоЭтапам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КоличествоКандидатовПоЭтапам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>EnumRef.ЭтапыПодбора</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПройден</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзмененияЭтапа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Котельников_АБ_70153995/src/InformationRegisters/СтатусыКандидатов/СтатусыКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКандидатов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ЭтапыПодбора</types>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПройден</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Котельников_АБ_70153995/src/Enums/ЭтапыПодбора/ЭтапыПодбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭтапыПодбора</name>
  <enumValues>
    <name>Неразобранные</name>
  </enumValues>
  <enumValues>
    <name>ПросмотрРезюме</name>
  </enumValues>
  <enumValues>
    <name>ТелефонноеИнтервью</name>
  </enumValues>
  <enumValues>
    <name>ПервичноеСобеседование</name>
  </enumValues>
  <enumValues>
    <name>СобеседованиеСИнициатором</name>
  </enumValues>
  <enumValues>
    <name>Тестирование</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПринялПредложениеОРаботе</name>
  </enumValues>
  <enumValues>
    <name>КандидатОтказалсяОтПредложения</name>
  </enumValues>
  <enumValues>
    <name>ОтказКандидату</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Enums/СтатусыТелефонногоИнтервью/СтатусыТелефонногоИнтервью.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыТелефонногоИнтервью</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Состоялось</name>
  </enumValues>
  <enumValues>
    <name>НеСостоялось</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Documents/ПроведениеТелефонногоИнтервью/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РегистрацияКандидатов") Тогда
		Вакансия = ДанныеЗаполнения.Вакансия;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаписатьДвиженияКоличествоКандидатовПоЭтапам();
	ЗаписатьДвиженияСтатусыКандидатов();

КонецПроцедуры

Процедура ЗаписатьДвиженияКоличествоКандидатовПоЭтапам()

	// регистр накопления КоличествоКандидатовПоЭтапам Расход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.ПросмотрРезюме;
	Движение.ЭтапПройден = Истина;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;

	// регистр накопления КоличествоКандидатовПоЭтапам Приход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.ТелефонноеИнтервью;
	Если СтатусИнтервью = Перечисления.СтатусыТелефонногоИнтервью.Запланировано ИЛИ СтатусИнтервью = Перечисления.СтатусыТелефонногоИнтервью.НеСостоялось Тогда
		Движение.ЭтапПройден = Ложь;
	ИначеЕсли СтатусИнтервью = Перечисления.СтатусыТелефонногоИнтервью.Состоялось Тогда
		Движение.ЭтапПройден = Истина;
	КонецЕсли;	
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;	

КонецПроцедуры

Процедура ЗаписатьДвиженияСтатусыКандидатов()

	// регистр сведений СтатусыКандидатов
	Движения.СтатусыКандидатов.Записывать = Истина;
	Движение = Движения.СтатусыКандидатов.Добавить();
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Если СтатусИнтервью = Перечисления.СтатусыТелефонногоИнтервью.Запланировано ИЛИ СтатусИнтервью = Перечисления.СтатусыТелефонногоИнтервью.НеСостоялось Тогда
		Движение.ЭтапПройден = Ложь;
	ИначеЕсли СтатусИнтервью = Перечисления.СтатусыТелефонногоИнтервью.Состоялось Тогда
		Движение.ЭтапПройден = Истина;
	КонецЕсли;	
	Движение.Статус = Перечисления.ЭтапыПодбора.ТелефонноеИнтервью;
	
КонецПроцедуры
